import React from "react";
import { Navigation, Pagination, EffectCoverflow, Scrollbar, A11y } from "swiper";

import { Swiper, SwiperSlide } from "swiper/react";
import { FaRegUser } from "react-icons/fa";

import user from '../../../assets/Images/user.png';

// Import Swiper styles
import "swiper/css";
import "swiper/css/navigation";
// import 'swiper/css/pagination';
import "swiper/css/scrollbar";

const CustomerReview = () => {
    const allPlan = [
        { id: "1", userName: "Jack", userImg: "url", reviewText: "তরুলতা  আমাকে একটি চমৎকার অভিজ্ঞতা প্রদান করেছে। ওয়েবসাইটটি ব্যবহারকারী-বান্ধব ছিল, এটি ব্রাউজ করা এবং আমার প্রয়োজনের জন্য নিখুঁত গাছ নির্বাচন করা সহজ করে তুলেছে। অর্ডার করার প্রক্রিয়াটি মসৃণ ছিল, এবং গাছগুলি খুব ভালো অবস্থায় পৌঁছেছিল, সাবধানে সুরক্ষার জন্য প্যাকেজ করা হয়েছে। গ্রাহক পরিষেবাটি অসামান্য ছিল, আমার যেকোন জিজ্ঞাসার তাত্ক্ষণিকভাবে সমাধান করা হয়েছে। আমি গাছের গুণমান নিয়ে রোমাঞ্চিত, যা আমার ল্যান্ডস্কেপে সৌন্দর্য এবং জীবনীশক্তি যোগ করেছে। যে কেউ গাছ কেনার ঝামেলা খুঁজছেন তাদের জন্য এই ওয়েবসাইটের সুপারিশ করুন- বিনামূল্যে।", review: 5 },
        { id: "2", userName: "Jack", userImg: "url", reviewText: "তরুলতা  আমাকে একটি চমৎকার অভিজ্ঞতা প্রদান করেছে। ওয়েবসাইটটি ব্যবহারকারী-বান্ধব ছিল, এটি ব্রাউজ করা এবং আমার প্রয়োজনের জন্য নিখুঁত গাছ নির্বাচন করা সহজ করে তুলেছে। অর্ডার করার প্রক্রিয়াটি মসৃণ ছিল, এবং গাছগুলি খুব ভালো অবস্থায় পৌঁছেছিল, সাবধানে সুরক্ষার জন্য প্যাকেজ করা হয়েছে। গ্রাহক পরিষেবাটি অসামান্য ছিল, আমার যেকোন জিজ্ঞাসার তাত্ক্ষণিকভাবে সমাধান করা হয়েছে। আমি গাছের গুণমান নিয়ে রোমাঞ্চিত, যা আমার ল্যান্ডস্কেপে সৌন্দর্য এবং জীবনীশক্তি যোগ করেছে। যে কেউ গাছ কেনার ঝামেলা খুঁজছেন তাদের জন্য এই ওয়েবসাইটের সুপারিশ করুন- বিনামূল্যে।", review: 5 },
        { id: "3", userName: "Jack", userImg: "url", reviewText: "তরুলতা  আমাকে একটি চমৎকার অভিজ্ঞতা প্রদান করেছে। ওয়েবসাইটটি ব্যবহারকারী-বান্ধব ছিল, এটি ব্রাউজ করা এবং আমার প্রয়োজনের জন্য নিখুঁত গাছ নির্বাচন করা সহজ করে তুলেছে। অর্ডার করার প্রক্রিয়াটি মসৃণ ছিল, এবং গাছগুলি খুব ভালো অবস্থায় পৌঁছেছিল, সাবধানে সুরক্ষার জন্য প্যাকেজ করা হয়েছে। গ্রাহক পরিষেবাটি অসামান্য ছিল, আমার যেকোন জিজ্ঞাসার তাত্ক্ষণিকভাবে সমাধান করা হয়েছে। আমি গাছের গুণমান নিয়ে রোমাঞ্চিত, যা আমার ল্যান্ডস্কেপে সৌন্দর্য এবং জীবনীশক্তি যোগ করেছে। যে কেউ গাছ কেনার ঝামেলা খুঁজছেন তাদের জন্য এই ওয়েবসাইটের সুপারিশ করুন- বিনামূল্যে।", review: 5 },
        { id: "4", userName: "Jack", userImg: "url", reviewText: "তরুলতা  আমাকে একটি চমৎকার অভিজ্ঞতা প্রদান করেছে। ওয়েবসাইটটি ব্যবহারকারী-বান্ধব ছিল, এটি ব্রাউজ করা এবং আমার প্রয়োজনের জন্য নিখুঁত গাছ নির্বাচন করা সহজ করে তুলেছে। অর্ডার করার প্রক্রিয়াটি মসৃণ ছিল, এবং গাছগুলি খুব ভালো অবস্থায় পৌঁছেছিল, সাবধানে সুরক্ষার জন্য প্যাকেজ করা হয়েছে। গ্রাহক পরিষেবাটি অসামান্য ছিল, আমার যেকোন জিজ্ঞাসার তাত্ক্ষণিকভাবে সমাধান করা হয়েছে। আমি গাছের গুণমান নিয়ে রোমাঞ্চিত, যা আমার ল্যান্ডস্কেপে সৌন্দর্য এবং জীবনীশক্তি যোগ করেছে। যে কেউ গাছ কেনার ঝামেলা খুঁজছেন তাদের জন্য এই ওয়েবসাইটের সুপারিশ করুন- বিনামূল্যে।", review: 5 },
        { id: "5", userName: "Jack", userImg: "url", reviewText: "তরুলতা  আমাকে একটি চমৎকার অভিজ্ঞতা প্রদান করেছে। ওয়েবসাইটটি ব্যবহারকারী-বান্ধব ছিল, এটি ব্রাউজ করা এবং আমার প্রয়োজনের জন্য নিখুঁত গাছ নির্বাচন করা সহজ করে তুলেছে। অর্ডার করার প্রক্রিয়াটি মসৃণ ছিল, এবং গাছগুলি খুব ভালো অবস্থায় পৌঁছেছিল, সাবধানে সুরক্ষার জন্য প্যাকেজ করা হয়েছে। গ্রাহক পরিষেবাটি অসামান্য ছিল, আমার যেকোন জিজ্ঞাসার তাত্ক্ষণিকভাবে সমাধান করা হয়েছে। আমি গাছের গুণমান নিয়ে রোমাঞ্চিত, যা আমার ল্যান্ডস্কেপে সৌন্দর্য এবং জীবনীশক্তি যোগ করেছে। যে কেউ গাছ কেনার ঝামেলা খুঁজছেন তাদের জন্য এই ওয়েবসাইটের সুপারিশ করুন- বিনামূল্যে।", review: 5 },
        { id: "6", userName: "Jack", userImg: "url", reviewText: "তরুলতা  আমাকে একটি চমৎকার অভিজ্ঞতা প্রদান করেছে। ওয়েবসাইটটি ব্যবহারকারী-বান্ধব ছিল, এটি ব্রাউজ করা এবং আমার প্রয়োজনের জন্য নিখুঁত গাছ নির্বাচন করা সহজ করে তুলেছে। অর্ডার করার প্রক্রিয়াটি মসৃণ ছিল, এবং গাছগুলি খুব ভালো অবস্থায় পৌঁছেছিল, সাবধানে সুরক্ষার জন্য প্যাকেজ করা হয়েছে। গ্রাহক পরিষেবাটি অসামান্য ছিল, আমার যেকোন জিজ্ঞাসার তাত্ক্ষণিকভাবে সমাধান করা হয়েছে। আমি গাছের গুণমান নিয়ে রোমাঞ্চিত, যা আমার ল্যান্ডস্কেপে সৌন্দর্য এবং জীবনীশক্তি যোগ করেছে। যে কেউ গাছ কেনার ঝামেলা খুঁজছেন তাদের জন্য এই ওয়েবসাইটের সুপারিশ করুন- বিনামূল্যে।", review: 5 },
        { id: "7", userName: "Jack", userImg: "url", reviewText: "তরুলতা  আমাকে একটি চমৎকার অভিজ্ঞতা প্রদান করেছে। ওয়েবসাইটটি ব্যবহারকারী-বান্ধব ছিল, এটি ব্রাউজ করা এবং আমার প্রয়োজনের জন্য নিখুঁত গাছ নির্বাচন করা সহজ করে তুলেছে। অর্ডার করার প্রক্রিয়াটি মসৃণ ছিল, এবং গাছগুলি খুব ভালো অবস্থায় পৌঁছেছিল, সাবধানে সুরক্ষার জন্য প্যাকেজ করা হয়েছে। গ্রাহক পরিষেবাটি অসামান্য ছিল, আমার যেকোন জিজ্ঞাসার তাত্ক্ষণিকভাবে সমাধান করা হয়েছে। আমি গাছের গুণমান নিয়ে রোমাঞ্চিত, যা আমার ল্যান্ডস্কেপে সৌন্দর্য এবং জীবনীশক্তি যোগ করেছে। যে কেউ গাছ কেনার ঝামেলা খুঁজছেন তাদের জন্য এই ওয়েবসাইটের সুপারিশ করুন- বিনামূল্যে।", review: 5 },

    ];
    return (
        <div className=" mb-20 w-[70%] mx-auto">
            <div className="relative text-center mt-6 md:mt-16    ">
                <div className="hover-product pt-5">
                    <h1 className="text-xl md:text-3xl text-primary-text font-medium pb-3">
                        আমাদের গ্রাহকরা কি বলে
                    </h1>
                    <div className="my-border-1 mx-auto w-[10rem] px-10 mt-[-2px]"></div>
                </div>
            </div>
            <div className="mt-6">
                <Swiper
                    effect={'coverflow'}
                    grabCursor={true}
                    centeredSlides={true}
                    loop={true}
                    speed={1000}
                    autoplay={{ delay: 3000 }}
                    slidesPerView={'auto'}
                    coverflowEffect={{
                        rotate: 0,
                        stretch: 0,
                        depth: 100,
                        modifier: 2.5,
                    }}
                    pagination={{
                        clickable: true,

                    }}
                    modules={[EffectCoverflow, Pagination, Navigation]}
                    className="swiper_container"
                    breakpoints={{
                        0: {
                            slidesPerView: 1,
                        },
                        400: {
                            slidesPerView: 1,
                        },
                        639: {
                            slidesPerView: 2,
                        },
                        865: {
                            slidesPerView: 2,
                        },
                        1000: {
                            slidesPerView: 3
                        },
                        1700: {
                            slidesPerView: 3
                        }
                    }}

                >
                    {allPlan?.map((a, key) => {
                        return (
                            <SwiperSlide key={key}>
                                {({ isActive }) => (
                                    <div className="flex flex-col  bg-white border border-primary  shadow-sm">
                                        <div className="px-4 py-8 rounded-t-lg sm:px-8 md:px-12 shadow-md">
                                            <div className="flex flex-col items-center justify-center p-8 rounded-b-lg ">
                                                <img src={user} className="w-[60px] h-[60px]" alt="" />
                                                <p className="text-xl font-semibold leading-tight">Sourav Biswas</p>
                                                <p className="text-sm uppercase">Full Stack Developer</p>
                                            </div>
                                            <p className="relative px-6 py-1 text-lg italic text-center ">

                                                {
                                                    a?.reviewText.length <= 166 ? a?.reviewText : a?.reviewText.slice(0, 166) + '......'
                                                }

                                            </p>
                                        </div>

                                    </div>
                                )}
                            </SwiperSlide>
                        );
                    })}
                </Swiper>
            </div>
        </div>



    );
};

export default CustomerReview;
