import React, { useState } from 'react';

import AccordianItem from './AccordianItem';

const Accordian = () => {
    const [open, setOpen] = useState(false)

    const toggle = (index) => {
        if (open === index) {
            return setOpen(false)
        }
        setOpen(index)
    }

    const demoData = [
        {
            title: 'আপনার নার্সারী কি প্রকার গাছ ও উদ্ভিদের সরবরাহ করে ?',
            des: 'আমরা বিভিন্ন প্রকার ফুল গাছ, ছোট বৃক্ষ, গ্রাস, ফলমূল গাছ  সরবরাহ করে থাকি ।'

        },
        {
            title: 'কিভাবে আমি আপনার নার্সারী থেকে গাছ বা উদ্ভিদ ক্রয় করতে পারি ?',
            des: 'আপনি আমাদের ওয়েবসাইটে গিয়ে আপনার পছন্দসই উদ্ভিদগুলি সম্পর্কে জানতে এবং অর্ডার করতে পারেন। আপনার পছন্দের গাছগুলি সংরক্ষণ এবং প্যাক করে এবং তা আপনার ঠিকানায় পাঠিয়ে দিবো ।'

        },
        {
            title: 'কীভাবে নিশ্চিত করবেন যে আমি কোন ক্ষতিগ্রস্ত গাছ বা উদ্ভিদ কিনছি না ?',
            des: 'আমরা সতর্কতার সাথে সমস্যাগুলি চেক  করে নিবিড়ভাবে নিশ্চিত করি সেরা মানের গাছ ও গাছের চারা। পন্যটি নেওয়ার সময় আপনি নিজেও চেক করে নেওয়ার সুযোগ থাকছে । '

        },
        {
            title: 'কীভাবে আমি নিশ্চিত করতে পারি যে আমি আমার পছন্দসই উদ্ভিদগুলি পেয়েছি ? ',
            des: 'আপনি আমাদের ওয়েবসাইটে গিয়ে উদ্ভিদগুলির ছবি, বর্ণনা এবং উপকারিতা দেখতে পারেন এবং আপনি যদি আপনার পছন্দসই উদ্ভিদগুলি পেয়েছেন তবে আপনি তাদের অর্ডার করতে পারেন ।'

        }, {
            title: 'কীভাবে আমি আপনার ওয়েবসাইটের গাছগুলির বাইরে অন্য গাছের দাম কিভাবে  জানতে পারি ? ',
            des: 'এর জন্য ওয়েবসাইটে থাকা আমাদের ফোন নাম্বারে অথবা হোয়াটসঅ্যাপ বা মেসেঞ্জারে যোগাযোগ করলে আমরা আপনার গাছের দাম জানিয়ে দিবো ।'

        },
    ]
    return (
        <div>
            {
                demoData.map((data, index) => {
                    return <AccordianItem key={index} toggle={() => toggle(index)} title={data.title} des={data.des} open={index === open} />
                })
            }
        </div>
    );
};

export default Accordian;